icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_gps.c
#if 0
/**/
static double gpsToRad( GPSPoint point )
{
	return point.sign * ( point.deg + ( point.min + point.sec / 60.0 ) / 60.0 ) * 3.141592654 / 180.0;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static double getDistance( GPSPoint latFrom, GPSPoint lngFrom, GPSPoint latTo, GPSPoint lngTo )
{
	double	latFromRad	= gpsToRad( latFrom );
	double	lngFromRad	= gpsToRad( lngFrom );
	double	latToRad	= gpsToRad( latTo );
	double	lngToRad	= gpsToRad( lngTo );
	double	lngDiff		= lngToRad - lngFromRad;
	double	part1		= pow( cos( latToRad ) * sin( lngDiff ), 2 );
	//double part2 = pow( cos(latFromRad)*sin(latToRad)*cos(lngDiff) , 2);
	double	part2 = pow( cos( latFromRad ) * sin( latToRad ) - sin( latFromRad ) * cos( latToRad ) * cos( lngDiff ), 2 );

	double	part3 = sin( latFromRad ) * sin( latToRad ) + cos( latFromRad ) * cos( latToRad ) * cos( lngDiff );
	//double centralAngle = atan2( sqrt(part1 + part2) / part3 );
	double	centralAngle = atan( sqrt( part1 + part2 ) / part3 );
	return 6371.01 * 1000.0 * centralAngle; //Return Distance in meter
}

#endif


/*只能做1->0的写入*/
#define ATTR_NONET_NOREPORT 0xFF    /*未登网 未上报 */
#define ATTR_ONNET_NOREPORT 0xFE    /*已登网 上报失败 */
#define ATTR_REPORTED		0xFC    /*已上报 11111100*/

typedef __packed struct
{
	uint32_t	mn;
	uint32_t	id;
	uint8_t		attr;
	uint8_t		unused;
	uint16_t	len;
	//uint32_t	msg_id;		/*上报的消息头0x0200*/
}GPS_REPORT_HEAD;

typedef struct
{
	uint32_t	addr;
	uint32_t	id;
	uint8_t		attr;
	uint16_t	len;
}REPORT_INFO;

REPORT_INFO		report_curr = { 0, 0, 0, 0 };

static uint32_t report_addr[20];            /*上报记录的地址*/
static uint8_t	report_get_count	= 0;    /*获取的未上报记录数*/
static uint32_t report_get_addr		= 0;    /*获取的未上报记录最小id的地址*/

static uint16_t report_count = 0;           /*还没有上报的记录数*/
static uint8_t	report_trans_normal = 0;	//0表示当前发送的是补报数据(发送命令0x0704)，1表示正常数据(命令0x0200)；

extern STRUCT_GSM_PARAM gsm_param;


extern void sd_write_console(char *str);

/*********************************************************************************
  *函数名称:void gps_fact_set( void )
  *功能描述:格式化GPS定位数据存储区域
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-12-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void gps_fact_set(void)
{
 	u32					TempAddress;
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	for( TempAddress = ADDR_DF_POSTREPORT_START; TempAddress < ADDR_DF_POSTREPORT_END; )
	{
		sst25_erase_4k( TempAddress );
		TempAddress += 4096;
	}
	rt_sem_release( &sem_dataflash );
}

/*
   上报信息收到响应,通用应答 0x8001
 */
static JT808_MSG_STATE jt808_report_response( JT808_TX_NODEDATA * nodedata, uint8_t *pmsg )
{
	uint8_t			* msg = pmsg + 12;
	uint16_t		ack_id;
	uint16_t		ack_seq;
	uint8_t			ack_res;
	uint32_t		addr;

	GPS_REPORT_HEAD head;
	uint32_t		i;

	ack_seq = ( msg[0] << 8 ) | msg[1];
	ack_id	= ( msg[2] << 8 ) | msg[3];
	ack_res = *( msg + 4 );
	rt_kprintf("\r\n JT808 TX 0x0200 RESPONSE_1");
	if( ack_res == 0 )
	{
		rt_kprintf("_2");
		rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
		if( ack_id == 0x0200 )              /*在线上报*/
		{
			rt_kprintf("_3");
			addr = *( (uint32_t*)( nodedata->user_para ) );
			sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
			rt_kprintf("   write addr=%X",addr);
			rt_kprintf("   head=");
			printf_hex_data((const u8 *)&head,sizeof(head));
			if(( head.mn == 0x474E5353 )&&(head.attr >= ATTR_ONNET_NOREPORT))
			{
				head.attr &= 0x7F;          /*最高位置0*/
				sst25_write_through( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
				report_get_addr = addr;
				if( report_count )
				{
					report_count--;
				}
			}
			//nodedata->user_para = RT_NULL;  /*传递进来只是指明flash地址，并不是要释放*/
		}
		else if( ack_id == 0x0704 )              /*批量上报*/
		{
			for( i = 0; i < report_get_count; i++ )
			{
				sst25_read( report_addr[i], (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
				if(( head.mn == 0x474E5353 )&&(head.attr >= ATTR_ONNET_NOREPORT))
				{
					head.attr &= 0x7F;      /*最高位置0*/
					sst25_write_through( report_addr[i], (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
					report_get_addr = report_addr[i];
					if( report_count )
					{
						report_count--;
					}
				}
			}
		}
		rt_sem_release( &sem_dataflash );
	}

	return ACK_OK;
}

/*
   消息发送超时,保存数据为补报
 */
static JT808_MSG_STATE jt808_report_timeout( JT808_TX_NODEDATA * nodedata )
{
	//nodedata->user_para = RT_NULL; /*传递进来只是指明flash地址，并不是要释放*/
	return ACK_TIMEOUT;
}


/*********************************************************************************
  *函数名称:void jt808_report_init( void )
  *功能描述:查找最后一个写入的位置,  查找未上报记录最小id的位置, 
  			初始化数据存储相关参数，初始化GPS压缩数据数据存储相关参数(gps_pack_init)
  			注意:该函数只能用来初始化存储区域，不可增加只能初始化一次的代码，不如不能初始化信号量
  			不能初始化线程等
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2014-03-5
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void jt808_report_init( void )
{
	uint32_t		addr;
	GPS_REPORT_HEAD head;
	uint32_t		read_id = 0xFFFFFFFF;
	
	gps_pack_init( );		///只有需要压缩原始GPS数据才需要该函数
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );

	report_count		= 0; /*重新查找*/
	report_curr.addr	= 0;
	report_curr.id		= 0;
	report_curr.len		= 0;

	memset( report_addr, 0, sizeof( report_addr ) );

	for( addr = ADDR_DF_POSTREPORT_START; addr < ADDR_DF_POSTREPORT_END; addr += 64 )
	{
		sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )         /*有效记录*/
		{
			if( head.id >= report_curr.id ) /*查找最近记录,当前写入的位置*/
			{
				report_curr.id		= head.id;
				report_curr.addr	= addr; /*当前记录的地址*/
				report_curr.len		= head.len;
			}
			if( head.attr > 0x7F )          /*bit7=1 还没有发送*/
			{
				report_count++;             /*统计未上报记录数*/
				if( read_id > head.id )     /*要找到最小id的地址*/
				{
					report_get_addr = addr;
					read_id			= head.id;
				}
			}
		}
	}
	if(report_count == 0)
		{
		report_get_addr =  report_curr.addr;
		}
	rt_sem_release( &sem_dataflash );
	rt_kprintf( "\n%d>(%d)写入位置:%x id=%d 读出位置:%x id=%d",
	            rt_tick_get( ),
	            report_count,
	            report_curr.addr,
	            report_curr.id,
	            report_get_addr,
	            read_id );
}

