icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_gps.c
/*补报数据保存*/
void jt808_report_put( uint8_t* pinfo, uint16_t len )
{
	GPS_REPORT_HEAD head;
	uint32_t *p_addr;
	char tempbuf[64];
	
	if((report_curr.id == 0)&&((jt808_status & BIT_STATUS_FIXED) == 0))
		{
		gps_reset_time = 600;
		return;
		}
	
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );

	if( report_curr.addr )                  /*当先的上报地址*/
	{
		report_curr.addr	+= ( 12 + report_curr.len + 63 );	//加63是为了取一个比较大的值
		report_curr.addr	&= 0xFFFFFFC0;  /*指向下一个地址*/
	}else                                   /*还没有记录*/
	{
		report_curr.addr = ADDR_DF_POSTREPORT_START;
	}

	if( report_curr.addr >= ADDR_DF_POSTREPORT_END )
	{
		report_curr.addr = ADDR_DF_POSTREPORT_START;
	}
	if( ( report_curr.addr & 0xFFF ) == 0 )
	{
		sst25_erase_4k( report_curr.addr );
	}

	report_curr.id++;
	report_curr.len = len;

	head.mn		= 0x474E5353;
	head.id		= report_curr.id;
	head.len	= len;

	if(( gsm_socket[0].state == CONNECTED )&&(jt808_state == JT808_REPORT))  /*当前在线，保存并直接上报*/
	{
		head.attr = ATTR_ONNET_NOREPORT;
		//jt808_add_tx( 1, SINGLE_CMD, 0x0200, -1, jt808_report_timeout, jt808_report_response, len, pinfo, (void*)report_curr.addr );
	}else /*是需要补报的信息*/
	{
		report_trans_normal = 0;
		head.attr = ATTR_NONET_NOREPORT;
	}

	sst25_write_through( report_curr.addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
	sst25_write_through( report_curr.addr + 12, pinfo, len );
	rt_sem_release( &sem_dataflash );
	sprintf(tempbuf,"写入GPS数据,ID=%05d,状态=%08X,报警=%08X,速度=%05d",head.id,jt808_status,jt808_param_bk.car_alarm,BYTESWAP2(gps_baseinfo.speed_10x));
	sd_write_console(tempbuf);
	report_count++;                     /*增加未上报记录数*/
	if( report_count == 1 )
	{
		report_get_addr = report_curr.addr;
		if(( gsm_socket[0].state == CONNECTED )&&(jt808_state == JT808_REPORT))
		{
			report_trans_normal = 1;		///表示补包数据已经发送完成，后面的数据以正常格式发送
		}
	}
	//如果当前存入的数据包是最后一包或者当前数据是上位机请求的临时位置跟踪信息，则需要上报
	if(( report_count == 1 )||( jt808_8202_track_duration ))             /*要找到最小的*/
	{
		///如果注册成功，则发送数据
		if(( gsm_socket[0].state == CONNECTED )&&(jt808_state == JT808_REPORT))
		{
			p_addr = rt_malloc(sizeof(uint32_t));
			if(p_addr != RT_NULL)
			{
				*p_addr = report_curr.addr;
				jt808_add_tx( 1, SINGLE_CMD, 0x0200, -1, jt808_report_timeout, jt808_report_response, len, pinfo, (void*)p_addr );
			}
		}
		//rt_kprintf( "\n%d>(%d)写入位置:%x id=%d", rt_tick_get( ), report_count, report_curr.addr, report_curr.id );
	}
}

/*
   补报数据更新原先的并读取新纪录
   每次收到中心应答后调用
   每次重新拨号成功后都要从新确认一下
   区分首次读还是上报中的读记录

   使用0704上报，要拼包
 */
uint8_t jt808_report_get( void )
{
	GPS_REPORT_HEAD head;
	uint8_t			buf[1024];              /*单包上报的字节不大于256*/
	uint32_t		i;
	uint32_t		addr;
	uint16_t		get_size;               /*获取记录的大小*/
	uint16_t		pos;
	uint8_t			read_count;             /*要读取的记录数*/
	uint32_t 		*p_addr;
	
	if( report_count == 0 )                 /*没有有未上报记录*/
	{
		return 0;
	}

	if(( gsm_socket[0].state != CONNECTED )||(jt808_state != JT808_REPORT))  /*不在线*/
	{
		return 0;
	}

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );

/*批量查找记录*/
	addr				= report_get_addr;
	report_get_count	= 0;
	get_size			= 3;
	pos					= 3;                            /*0x0704数据包，开始的偏移*/
	read_count			= report_count;                 /*还没有报的记录总数*/
	if( report_count > sizeof(report_addr)/sizeof(uint32_t) )                             /*最多1次上报10条记录 303字节*/
	{
		read_count = sizeof(report_addr)/sizeof(uint32_t);
	}
	for( i = 0; i < ADDR_DF_POSTREPORT_SECT * 64; i++ )   /*每记录64字节,每sector(4096Byte)有64记录*/
	{
		sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )                     /*有效记录*/
		{
			if( head.attr >= ATTR_ONNET_NOREPORT )      /*还没有发送*/
			{
				rt_kprintf("\r\njt808_report_get addr=%X",addr);
				rt_kprintf("   head=");
				printf_hex_data((const u8 *)&head,sizeof(head));
				///盲区补报数据用命令0x0704，但是只有公共货运平台支持该命令
				//判断需要发送的总长度是否超过单包发送的最大长度
				if( ( pos + head.len + 2 ) >= JT808_PACKAGE_MAX )
				{
					break;
				}
				buf[pos++]	= head.len >> 8;
				buf[pos++]	= head.len;
				sst25_read( addr + 12, buf + pos, head.len );
				pos								+= ( head.len );
				report_addr[report_get_count]	= addr;
				report_get_count++;
				if( report_get_count == read_count ) /*收到指定条数数据*/
				{
					break;
				}
				#ifndef GPS_GGHYPT
				break;
				#endif
				if( report_trans_normal )		///正常发送数据用命令0x0200
				{
					break;
				}
			}
			addr	+= ( 12 + head.len + 63 );	//加63是为了取一个比较大的值
			addr	&= 0xFFFFFFC0;  			//指向下一个地址
		}
		else
		{
			addr += 64;
		}
		if( addr >= ADDR_DF_POSTREPORT_END )
		{
			addr = ADDR_DF_POSTREPORT_START;
		}
	}
	rt_sem_release( &sem_dataflash );

	if( report_get_count ) /*得到的记录数*/
	{
		if( report_trans_normal )		///正常发送数据用命令0x0200
		{
			p_addr = rt_malloc(sizeof(uint32_t));
			if(p_addr != RT_NULL)
			{
				*p_addr = addr;
				jt808_add_tx( 1, SINGLE_CMD, 0x0200, -1, jt808_report_timeout, jt808_report_response, pos-5, buf+5, (void*)p_addr );
			}
			return;
		}
		#ifdef GPS_GGHYPT
		buf[0]	= report_get_count >> 8;
		buf[1]	= report_get_count & 0xff;
		buf[2]	= 1;
		jt808_add_tx( 1, SINGLE_CMD, 0x0704, -1, RT_NULL, jt808_report_response, pos, buf, RT_NULL );
		#else
		p_addr = rt_malloc(sizeof(uint32_t));
		if(p_addr != RT_NULL)
		{
			*p_addr = addr;
			jt808_add_tx( 1, SINGLE_CMD, 0x0200, -1, jt808_report_timeout, jt808_report_response, pos-5, buf+5, (void*)p_addr );
		}
		#endif
		return 1;
	}else
	{
		report_count = 0; /*没有得到要上报的数据*/
	}
	return 0;
	//rt_kprintf( "\n%d>(%d)读出位置:%x,记录数:%d,长度:%d", rt_tick_get( ), report_count, report_get_addr, report_get_count, pos );
}

/*
   处理gps信息,有多种条件组合，上报
   此时已收到争取的
 */
//#define GPS_TEST

#define FLAG_SEND_AREA			0x80
#define FLAG_SEND_STATUS		0x01
#define FLAG_SEND_ALARM			0x02
#define FLAG_SEND_FIX_TIME		0x04
#define FLAG_SEND_FIX_DISTANCE	0x08

/*处理上报*/
static uint8_t process_gps_report( void )
{
	static uint32_t utc_report_last = 0;
	uint32_t		tmp_s,tmp_a;
	uint8_t			flag_send	= 0; /*默认不上报*/
	uint8_t			*palarmdata = RT_NULL;
	uint16_t		alarm_length;
	uint32_t		alarm_bits;
	uint8_t 		ret = 0;

	uint8_t			buf[300];

	if(jt808_param.id_0xF00F==0)
		return 0;

/*区域路线处理*/
	alarm_bits = area_get_alarm( palarmdata, &alarm_length );
	if( alarm_bits ) /*有告警*/
	{
		rt_kprintf( "\n区域有告警" );
		memcpy( buf + sizeof(gps_baseinfo), palarmdata, alarm_length );
		flag_send = FLAG_SEND_AREA;
	}
	jt808_param_bk.car_alarm			|= alarm_bits;
	gps_baseinfo.alarm	= BYTESWAP4( jt808_param_bk.car_alarm );
	gps_baseinfo.status = BYTESWAP4( jt808_status );
	memcpy( buf, (uint8_t*)&gps_baseinfo, sizeof(gps_baseinfo) );

