icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_gps.c
				day		= ( ( buf [0] - 0x30 ) * 10 ) + ( buf [1] - 0x30 );
				mon		= ( ( buf [2] - 0x30 ) * 10 ) + ( buf [3] - 0x30 );
				year	= ( ( buf [4] - 0x30 ) * 10 ) + ( buf [5] - 0x30 );

				if( fDateModify )
				{
					day++;
					if( mon == 2 )
					{
						if( ( year % 4 ) == 0 ) /*没有考虑整百时，要被400整除，NM都2100年*/
						{
							if( day == 30 )
							{
								day = 1; mon++;
							}
						} else
						if( day == 29 )
						{
							day = 1; mon++;
						}
					} else
					if( ( mon == 4 ) || ( mon == 6 ) || ( mon == 9 ) || ( mon == 11 ) )
					{
						if( day == 31 )
						{
							mon++; day = 1;
						}
					} else
					{
						if( day == 32 )
						{
							mon++; day = 1;
						}
						if( mon == 13 )
						{
							mon = 1; year++;
						}
					}
				}

				/*都处理完了更新 gps_baseinfo,没有高程信息*/
				gps_lati		= lati;
				gps_longi		= longi;
				gps_speed		= speed_10x / 10;
				gps_cog			= cog;
				gps_datetime[0] = year;
				gps_datetime[1] = mon;
				gps_datetime[2] = day;
				gps_datetime[3] = hour;
				gps_datetime[4] = min;
				gps_datetime[5] = sec;

				gps_baseinfo.alarm		= BYTESWAP4( jt808_param_bk.car_alarm );
				gps_baseinfo.status		= BYTESWAP4( jt808_status );
				gps_baseinfo.latitude	= BYTESWAP4( lati );
				gps_baseinfo.longitude	= BYTESWAP4( longi );
				gps_baseinfo.speed_10x	= BYTESWAP2( speed_10x );
				gps_baseinfo.cog		= BYTESWAP2( cog );

				//utc_now = linux_mktime( 2000 + year, mon, day, hour, min, sec );

				gps_baseinfo.datetime[0]	= HEX2BCD( year );
				gps_baseinfo.datetime[1]	= HEX2BCD( mon );
				gps_baseinfo.datetime[2]	= HEX2BCD( day );
				gps_baseinfo.datetime[3]	= HEX2BCD( hour );
				gps_baseinfo.datetime[4]	= HEX2BCD( min );
				gps_baseinfo.datetime[5]	= HEX2BCD( sec );

				//对累计路程进行积分
				jt808_param_bk.car_mileage	+= speed_10x;
				
				//附加消息体部分
				gps_baseinfo.mileage_id		= 0x01;
				gps_baseinfo.mileage_len	= 0x04;
				gps_baseinfo.csq_id			= 0x30;
				gps_baseinfo.csq_len		= 0x01;
				gps_baseinfo.NoSV_id		= 0x31;
				gps_baseinfo.NoSV_len		= 0x01;
				gps_baseinfo.mileage		= BYTESWAP4(jt808_param_bk.car_mileage / 3600);
				gps_baseinfo.csq			= gsm_param.csq;
				gps_baseinfo.NoSV			= gps_status.NoSV;

				/*首次定位,校时*/
				if( ( jt808_status & BIT_STATUS_FIXED ) == 0 )
				{
					mytime_now								= MYDATETIME( year, mon, day, hour, min, sec );
					//*(__IO uint32_t*)( BKPSRAM_BASE + 4 )	= utc_now;
					jt808_param_bk.utctime = mytime_to_utc(mytime_now);
					param_save_bksram();
					date_set( year, mon, day );
					time_set( hour, min, sec );
					rt_kprintf( "\n%d>rtc sync %02d-%02d-%02d %02d:%02d:%02d", rt_tick_get( ), year, mon, day, hour, min, sec );
					sd_write_console(pinfo);
				}
				#ifdef GPS_TEST
				else if(gps_speed)
				{
					sd_write_console(pinfo);
				}
				#endif

				if( gps_datetime[5] == 0 )      /*整分钟*/
				{
					mytime_now								= MYDATETIME( year, mon, day, hour, min, sec );
					//*(__IO uint32_t*)( BKPSRAM_BASE + 4 )	= utc_now;
					jt808_param_bk.utctime = mytime_to_utc(mytime_now);
					param_save_bksram();
					if( gps_datetime[4] == 0 )  /*整小时校准*/
					{
						date_set( year, mon, day );
						time_set( hour, min, sec );
					}
				}
				jt808_status |= BIT_STATUS_FIXED;
				return 0;
		}
		count	= 0;
		memset(buf,0,sizeof(buf));
	}
	return 10;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
uint8_t process_gga( uint8_t * pinfo )
{
	//检查数据完整性,执行数据转换
	uint8_t		NoSV;
	uint8_t		i;
	uint8_t		buf[20];
	uint8_t		commacount	= 0, count = 0;
	uint8_t		*psrc		= pinfo + 7; //指向开始位置
	uint16_t	altitute;

	while( *psrc++ )
	{
		if( *psrc != ',' )
		{
			buf[count++]	= *psrc;
			buf[count]		= 0;
			continue;
		}
		commacount++;
		switch( commacount )
		{
			case 1: /*时间处理 */
				if( count < 6 )
				{
					return 1;
				}
				break;

			case 2: /*纬度处理ddmm.mmmmmm*/
				break;

			case 3: /*N_S处理*/
				break;

			case 4: /*经度处理*/

				break;
			case 5: /*E_W处理*/
				break;
			case 6: /*定位类型*/
				break;
			case 7: /*NoSV,卫星数*/
				if( count < 1 )
				{
					break;
				}
				NoSV = 0;
				for( i = 0; i < count; i++ )
				{
					NoSV	= NoSV * 10;
					NoSV	+= ( buf[i] - 0x30 );
				}
				gps_status.NoSV = NoSV;
				break;
			case 8: /*HDOP*/
				return 0;

			case 9: /*MSL Altitute*/
				if( count < 1 )
				{
					break;
				}
				altitute = 0;
				for( i = 0; i < count; i++ )
				{
					if( buf[i] == '.' )
					{
						break;
					}
					altitute	= altitute * 10;
					altitute	+= ( buf[i] - '0' );
				}
				gps_baseinfo.altitude	= altitute;
				gps_alti				= altitute;
				return 0;
		}
		count	= 0;
		buf[0]	= 0;
	}
	return 9;
}

/***********************************************************
* Function:
* Description:gps收到信息后的处理，头两个字节为长度
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gps_rx( uint8_t * pinfo, uint16_t length )
{
	uint8_t ret;
	uint16_t i;
	char	* psrc;
	psrc = (char*)pinfo;

	*( psrc + length ) = 0;
	/*是否输出原始信息*/
	if( gps_status.Raw_Output )
	{
		//rt_kprintf( "\n%d gps<%s", rt_tick_get( ), psrc );
		rt_kprintf( "%s",psrc );
	}
	if(length < 6)
		return;
	/*保存RAW数据*/
	//jt808_gps_pack( (char*)pinfo, length );

	if( strncmp( psrc + 3, "GGA,", 4 ) == 0 )
	{
		if( strncmp( psrc + 1, "GN", 2 ) == 0 )
		{
			gps_status.mode = MODE_BDGPS;
		}else if( strncmp( psrc + 1, "GP", 2 ) == 0 )
		{
			gps_status.mode = MODE_GPS;
		}else if( strncmp( psrc + 1, "BD", 2 ) == 0 )
		{
			gps_status.mode = MODE_BD;
		}
		process_gga( (uint8_t*)psrc );
	}

	if( strncmp( psrc + 3, "RMC,", 4 ) == 0 )
	{
		gps_sec_count++;
		
		//去掉后面的不可见字符
		for(i=length-1;i>0;i--)
			{
			if(pinfo[i] > 0x1F)
				break;
			else
				{
				pinfo[i] = 0;
				}
			}
		ret = process_rmc( (uint8_t*)psrc );

		if( ret == 0 )                   /*已定位*/
		{
			gps_notfixed_count = 0;
			if(jt808_param.id_0xF00F)
			{
				process_hmi_15min_speed( ); /*最近15分钟速度*/
				vdr_rx_gps( );              /*行车记录仪数据处理*/
				area_process( );            /*区域线路告警*/
				calc_distance( );
			}
		}else
		{
			if(gps_notfixed_count%10 == 0)
				sd_write_console(psrc);
			//adjust_mytime_now( );       /*调整mytime_now*/
			gps_notfixed_count++;
		}
		process_gps_report( );      	/*处理GPS上报信息*/
	}


	/*天线开短路检测 gps<
	   $GNTXT,01,01,01,ANTENNA OK*2B
	   $GNTXT,01,01,01,ANTENNA OPEN*3B
	 */
	#if 0
	if( strncmp( psrc + 3, "TXT", 3 ) == 0 )
	{
		/*
		if( jt808_param.id_0xF013 != 0x3017 ) ///型号不对,保存新的，并重启
		{
			rt_kprintf( "\njt808_param.id_0xF013=%04x", jt808_param.id_0xF013 );
			jt808_param.id_0xF013 = 0x3017;
			param_save( 1 );
			reset( 3 );
		}
		*/
		if( strncmp( psrc + 24, "OK", 2 ) == 0 )
		{
			gps_status.Antenna_Flag = 0;
			jt808_param_bk.car_alarm				&= ~( BIT_ALARM_GPS_OPEN | BIT_ALARM_GPS_SHORT );
		}else if( strncmp( psrc + 24, "OPEN", 4 ) == 0 )
		{
			gps_status.Antenna_Flag = 1;
			jt808_param_bk.car_alarm				|= BIT_ALARM_GPS_OPEN; /*bit5 天线开路*/
		}else if( strncmp( psrc + 24, "SHORT", 4 ) == 0 )
		{
			gps_status.Antenna_Flag = 1;
			jt808_param_bk.car_alarm				|= BIT_ALARM_GPS_SHORT;
		}
	}
	#endif
}

/*初始化jt808 gps相关的处理*/
void jt808_gps_init( void )
{
	GPS_REPORT_HEAD head;
	rt_kprintf( "\n%d>jt808_gps_init",rt_tick_get() );
	jt808_report_init( );   /*上报区域初始化*/
	jt808_vehicle_init( );  /*车辆信息初始化*/
	area_init( );
	///将保存的最后一包定位位置设置为当前位置
	memset(&gps_baseinfo,0,sizeof(gps_baseinfo));
	if( report_curr.addr )
	{
		sst25_read( report_curr.addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )                     /*有效记录*/
		{
			sst25_read( report_curr.addr + 12, (uint8_t*)&gps_baseinfo, sizeof(gps_baseinfo) );
			gps_baseinfo.status &= ~(BYTESWAP4( BIT_STATUS_FIXED ));			///当前定位信息设置为未定位；
			
			if( jt808_param_bk.car_mileage == 0 )
			{
				jt808_param_bk.car_mileage	= gps_baseinfo.mileage;
				jt808_param_bk.car_mileage	*= 3600LL;
			}
		}
	}
	gps_baseinfo.mileage_id		= 0x01;
	gps_baseinfo.mileage_len	= 0x04;
	gps_baseinfo.csq_id			= 0x30;
	gps_baseinfo.csq_len		= 0x01;
	gps_baseinfo.NoSV_id		= 0x31;
	gps_baseinfo.NoSV_len		= 0x01;

	jt808_param_bk.car_alarm	&=(BIT(0) | BIT(3) | BIT(20) | BIT(21) | BIT(22) | BIT(27) | BIT(28));
	jt808_alarm_last			= jt808_param_bk.car_alarm;          /*上一次的上报状态*/
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gps_dump( uint8_t mode )
{
	gps_status.Raw_Output = ~gps_status.Raw_Output;
}
FINSH_FUNCTION_EXPORT( gps_dump, dump gps raw info );




/************************************** The End Of File **************************************/

#ifdef DEBUG_GPS
/**模拟调试gps速度*/
void gps_speed_add( uint32_t sp, uint32_t count )
{
	speed_add	= sp * 1000 / 1852;
	speed_count = count;
	rt_kprintf("\n GPG speed add=%d",sp);
}

FINSH_FUNCTION_EXPORT_ALIAS( gps_speed_add, gps_speed, debug gps speed );
#endif

/************************************** The End Of File **************************************/
